      *Skeleton COBOL Copybook - PIC X(63) - Jarrod Lee - 3/20/14*
       FD CARD-TYPE-FILE.             
       01  CA-TY-REC.                 
           03  CTY-ID	   PIC 9(3).
           03  CTY-NAME    PIC X(60).


