      *Skeleton COBOL Copybook - PIC X(63) - Jarrod Lee - 3/20/14*
       FD  CARD-TYPE-FILE.             
       01  CTY-REC.                 
           03  CTY-ID	       PIC 9(3).
           03  CTY-NAME        PIC X(60).
        
       FD  CARD-TYPE-FILE-DAT.
       01  CTY-REC-DAT.
           03  CTY-ID-DAT      PIC 9(3).
           03  CTY-NAME-DAT    PIC X(60).


