      *Skeleton COBOL Copybook - PIC X(141) - Ryan Timmerman - 4/2/14*
       FD CO-CARDHOLDER-FILE.
       01 CARDHOLDER-REC.
           05 CH-ID         PIC 9(8).
           05 CH-FNAME      PIC X(15).
           05 CH-LNAME      PIC X(15).
           05 CH-PHONE      PIC 9(10).
           05 CH-EMAIL      PIC X(35).
           05 CH-CITY       PIC X(35).
           05 CH-ST         PIC X(2).
           05 CH-ZIP        PIC 9(5).
           05 CH-CC         PIC 9(16).


