      *Skeleton COBOL Copybook - PIC X(44) - Ryan Timmerman - 4/2/14*
       FD CO-TRANSACTIONS-FILE.
       01 TRANSACTION-REC.
           05 TR-ID            PIC 9(8).
           05 TR-DATE          PIC 9(8).
           05 TR-AMT           PIC 9(10)V99.
           05 TR-VIDEO-ID      PIC 9(8).
           05 TR-CARD-ID       PIC 9(8).


