      *Skeleton COBOL Copybook - PIC X(141) - Ryan Timmerman - 4/2/14*
       FD  VUFLIX-MEMBER-FILE.
       01  VM-REC.
           05 VM-ID         PIC 9(8).
           05 VM-FNAME      PIC X(15).
           05 VM-LNAME      PIC X(15).
           05 VM-PHONE      PIC 9(11).
           05 VM-EMAIL      PIC X(35).
           05 VM-ZIP        PIC 9(5).
           05 VM-CC         PIC 9(16).
       
      


