      *Skeleton COBOL Copybook - PIC X(65) - Ryan Timmerman - 4/2/14*
       FD VIDEO-INV-FILE.
       01 V-VIDEO-INV-FILE-REC.
           05 IF-ID            PIC 9(8).
           05 IF-TITLE         PIC X(35).
           05 IF-GENRE         PIC X(20).
           05 IF-QUANTITY      PIC 9(2).
