      *Skeleton COBOL Copybook - PIC X(65) - Ryan Timmerman - 4/2/14*
       FD VUFLIX-MOVIE-LIST-FILE.
       01 VML-REC.
           05 VML-ID            PIC 9(6).
           05 VML-TITLE         PIC X(35).
           05 VML-GENRE         PIC X(20).
           05 VML-QUANTITY      PIC 9(2).
