       program-id. G3_VFX_7_MOV_INQ as "G3_VFX_7_MOV_INQ".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.


           goback.

       end program G3_VFX_7_MOV_INQ.
