       program-id. G3_VFX_6_ADDREM as "G3_VFX_6_ADDREM".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.


           goback.

       end program G3_VFX_6_ADDREM.
