       program-id. G3_VFX_5_MOV_WISH as "G3_VFX_5_MOV_WISH".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.


           goback.

       end program G3_VFX_5_MOV_WISH.
