       program-id. Program2 as "Program2".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.


           goback.

       end program Program2.
