      *Skeleton COBOL Copybook - Jarrod Lee - 4/7/2014
       01  EXITSCREEN.
               05  LINE 24 COL 33 VALUE "Confirm exit 'Y'".
               05  LINE 24 COL 50 PIC X TO WS-EXIT AUTO.
      


