      *Skeleton COBOL Copybook
       SELECT VUFLIX-MOVIE-LIST-FILE ASSIGN TO "VUFLIX-MOVIE-LIST.TXT"
               ORGANIZATION IS LINE SEQUENTIAL.


