      *Skeleton COBOL Copybook
       SELECT MERCHANT-LOCATION-FILE ASSIGN TO 'MERCHANT-LOCATION.TXT'
               ORGANIZATION IS LINE SEQUENTIAL.


