      *Skeleton COBOL Copybook - JARROD LEE - 3/20/14*
       SELECT CARD-TYPE-FILE ASSIGN TO 'CARD-TYPE.TXT'
               ORGANIZATION IS LINE SEQUENTIAL.


