      *Skeleton COBOL Copybook - JARROD LEE - 3/20/14*
       SELECT ISSUER-FILE ASSIGN TO 'ISSUER.TXT'
               ORGANIZATION IS LINE SEQUENTIAL.


