      *Skeleton COBOL Copybook - JARROD LEE - 3/20/14*
       SELECT MERCHANT-FILE ASSIGN TO 'MERCHANT.TXT'
               ORGANIZATION IS LINE SEQUENTIAL.


