      *Skeleton COBOL Copybook - JARROD LEE - 4/07/2014
       01  WS-TSTAMP.
           03  WS-YEAR        PIC XXXX.
           03  WS-MONTH       PIC XX.
           03  WS-DAY         PIC XX.
           03  WS-HOUR        PIC XX.
           03  WS-MINUTE      PIC XX.
               
       01  WS-SCREEN-VARIABLES.
           03  WS-SEL                  PIC X.
           03  WS-EXIT                 PIC X VALUE 'N'.
      


