       program-id. Program1 as "Program1".

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.


           goback.

       end program Program1.
